<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\User;
use App\Models\Movie;

class DummyDataSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $data = [
            [
                'title' => "Perfect Strangers (2022)", 
                'summary' => "လကြတ်ချိန်ဟာ နေနဲ့လတို့ကြားက တင်းမာမှု အပြင်းထန်ဆုံးအချိန်ဖြစ်ပြီး
                လူသားတွေကို စိတ်ကယောက်ကယက်ဖြစ်စေတယ်ဆိုပြီး အဆိုရှိပါတယ်။ Perfect Strangers(2022)လကြတ်ချိန်ဟာ နေနဲ့လတို့ကြားက တင်းမာမှု အပြင်းထန်ဆုံးအချိန်ဖြစ်ပြီး
                လူသားတွေကို စိတ်ကယောက်ကယက်ဖြစ်စေတယ်ဆိုပြီး အဆိုရှိပါတယ်။
                အဲဒီလို စိတ်ကယောက်ကယက်ဖြစ်စေတဲ့ လကြတ်ညတစ်ညမှာ
                မိတ်ဆွေသူငယ်ချင်း (၇) ယောက် ညစာအတူစားကြဖို့ စုမိကြပါတယ်။အန်ဒရီကိုနဲ့အီဗာတို့က သူတို့ရဲ့ အိမ်အသစ်ကြီးမှာ အိမ်တက်ပွဲအထိမ်းအမှတ်အနေနဲ့ ညစာဖိတ်ကျွေးတာပါ။
                ညစာစားပွဲမှာ အိမ်ရှင် လင်မယားနဲ့အတူ ညားခါစ စုံတွဲ အန်ဂျာ့စ်နဲ့ကီရှာ၊
                ကလေးနှစ်ယောက်ရနေပြီ ဖြစ်တဲ့ ဝစ်နူနဲ့အီမဲလ်ဒါ၊ ရည်စားရထားတာ မကြာသေးတဲ့ တိုမို ဆိုပြီး
                စုစုပေါင်း (၇) ယောက် ပါဝင်ပါတယ်။ပေါင်းလာတာ ကြာပြီဖြစ်တဲ့ အကြောင်းသိတွေ ပျော်ပျော်ပါးပါး စားကြသောက်ကြရင်း
                အိမ်ကြီးရှင် အီဗာက ဂိမ်းတစ်ခု ကစားကြဖို့ ပြောလိုက်ရာကနေ ဇာတ်လမ်းက စ,ပါတယ်။
                သူပြောတဲ့ ဂိမ်းက ဖုန်းတွေအားလုံးကို စားပွဲပေါ်မှာ တင်ထားပြီး
                ဝင်လာသမျှ မက်ဆေ့ဂျ်တွေ၊ ဖုန်းကောလ်တွေ၊ အီးမေးလ်တွေကို အတူတူဝိုင်းဖတ်ကြဖို့ပါ။ဆော့ရင်လည်း မကောင်း၊ မဆော့ပြန်ရင်လဲ အထင်လွဲခံရမှာစိုးတာနဲ့ အဲဒီဂိမ်းကို ဆော့ကြရင်းကနေ
                တစ်ယောက်ချင်းစီရဲ့ လျှို့ဝှက်ချက်တွေ ပေါ်လာပြီး ပြဿနာတွေက သပွတ်အူလို ရှုပ်ထွေးကုန်ပါတော့တယ်။လူတွေရဲ့ လူသိမခံနိုင်တဲ့ လျှို့ဝှက်ချက်တွေ၊ ခံစားချက်တွေကို တစ်စချင်းစီ ထုတ်ပြသွားတာကြောင့်
                (၂ )နာရီကျော်ကျော်က ဘယ်လိုကုန်လို့ကုန်သွားမှန်း မသိလိုက်တဲ့ ဇာတ်ကားမျိုးပါ။အညွှန်းဖတ်နေရင်းနဲ့ ဒီဇာတ်ကားကို ကြည့်ဖူးသလိုပဲလို့ ခံစားမိလာရင်တော့….ဟုတ်ပါတယ်….
                2016 က ထွက်ခဲ့တဲ့ အီတလီ ဇာတ်ကားကို remake ပြန်ရိုက်ထားတာပါ။မူရင်း အီတလီကားက အကြီးအကျယ်အောင်မြင်ခဲ့ပြီး
                စပိန်၊ မက္ကဆီကို၊ တောင်ကိုရီးယား၊ ပြင်သစ်၊ တရုတ်၊ ရုရှား အပါအဝင်
                နိုင်ငံပေါင်း ၂၀ ကျော်က remake ပြန်ရိုက်ခဲ့ကြပါတယ်။အဲဒီ remake တွေထဲကမှ ဒီကားကတော့ 2022 ခုနှစ်မှာ အင်ဒိုနီးရှားက ပြန်ရိုက်ထားတဲ့ ဇာတ်ကားပါ။အင်ဒို remake ကားဆိုပေမဲ့ အတော်လေး ကြည့်လို့ကောင်းပြီး
                setting ပိုင်း၊ သရုပ်ဆောင်ပိုင်း၊ musical ပိုင်း ဘာတစ်ခုမှ အပြစ်ပြောစရာ မရှိတဲ့ ဇာတ်ကားပါ။အီတလီဒဏ္ဍာရီနဲ့ အင်ဒိုရိုးရာတွေကို ပါးပါးနပ်နပ် ချိတ်ဆက်ပြထားပြီး
                မူရင်း ဇာတ်ကားရဲ့ အရသာလည်း မပျက်သလို ဆန်းသစ်တဲ့ တင်ဆက်မှုကိုလည်း မြင်တွေ့ရမှာပါ။mystery ဆန်ဆန် အထုပ်ဖြေပြတာမျိုးကို ကြိုက်ရင်တော့ မြည်းစမ်းကြည့်သင့်ပါတယ်။
                IMDb rating ကလည်း 7.5 အထိ ရထားပါတယ်။အညွှန်း နဲ့ ဘာသာပြန်ကတော့ Roman NoX ပဲ ဖြစ်ပါတယ်။", 
                'cover_image' => "https://image.tmdb.org/t/p/w185/rMSeZk9kCZhxVl3OOXIH29Gx1W6.jpg", 
                'genres' => 'Comedy, Drama', 
                'author' => 'Indonesia', 
                'tags' => "Action, drama", 
                'imdb_ratings' => 9.0, 
                'pdf_download_link' => "https://channelmyanmar.org/perfect-strangers-2022/"
            ],
            [
                'title' => "The Royal Nanny (2022)", 
                'summary' => "The Royal Nanny (2022)ငယ်ငယ်တုန်းက ကြည့်ခဲ့ရတဲ့ spy kids တို့ spy next door တို့လိုမျိုး
                ပေါ့ပေါ့ပါးပါးလဲဖြစ်မယ် ခိုင်မာတဲ့ဇာတ်အိမ်လေးလဲရှိမယ်
                မိသားစုနဲ့အတူ ပျော်ပျော်ပါးပါး အပန်းဖြေကြည့်ရှုဖို့ဆိုရင်တော့ နောက်ဆုံးထွက်လာတဲ့ ဒီဗြိတိန်ကားလေးကို ညွှန်းဆိုပေးပါရစေ
                ‌
                ဗြိတိန်တော်ဝင်မိသားစုကို အန္တရာယ်ပေးမယ့်သူတွေရှိနေလို့ အနီးကပ်အသွင်ယူအနေနဲ့
                ကလယ်ရာဟာ ‌ကလေးထိန်းအဖြစ်တာဝန်‌ထမ်းဆောင်ဖို့ အကြောင်းဖန်လာပါတယ်
                ဒီခြိမ်းခြောက်မှုကို ကြိုးကိုငါနေတာဘယ်သူလဲဆိုတာ ဇာတ်လမ်းအဆုံးထိ စိတ်ဝင်တစားကြည့်ရှုရမယ့်အပြင်
                ခရစ္စမတ်လို ဟောလီဒေးvibe ကို ရရှိနေမှာမလို့ ပရိသတ်ကြီးတို့ အပန်းဖြေကြည့်ရှုနိုင်ဖို့ တင်ဆက်ပေးလိုက်ပါတယ်", 
                'cover_image' => "https://channelmyanmar.org/wp-content/uploads/2023/02/MV5BNDBkNmVkMzQtNWI0Yi00ODgzLWJmYTQtMzc4N2ExNDFkN2ZjXkEyXkFqcGdeQXVyNDAwMzY0OTk@._V1_FMjpg_UX1000_.jpg", 
                'genres' => 'Action', 
                'author' => 'Aleksey Shaparev', 
                'tags' => "Comedy, Drama, Romance", 
                'imdb_ratings' => 6.9, 
                'pdf_download_link' => "https://channelmyanmar.org/the-royal-nanny-2022/"
            ],
            [
                'title' => "Perfect Strangers (2022)", 
                'summary' => "လကြတ်ချိန်ဟာ နေနဲ့လတို့ကြားက တင်းမာမှု အပြင်းထန်ဆုံးအချိန်ဖြစ်ပြီး
                လူသားတွေကို စိတ်ကယောက်ကယက်ဖြစ်စေတယ်ဆိုပြီး အဆိုရှိပါတယ်။အဲဒီလို စိတ်ကယောက်ကယက်ဖြစ်စေတဲ့ လကြတ်ညတစ်ညမှာ
                မိတ်ဆွေသူငယ်ချင်း (၇) ယောက် ညစာအတူစားကြဖို့ စုမိကြပါတယ်။အန်ဒရီကိုနဲ့အီဗာတို့က သူတို့ရဲ့ အိမ်အသစ်ကြီးမှာ အိမ်တက်ပွဲအထိမ်းအမှတ်အနေနဲ့ ညစာဖိတ်ကျွေးတာပါ။
                ညစာစားပွဲမှာ အိမ်ရှင် လင်မယားနဲ့အတူ ညားခါစ စုံတွဲ အန်ဂျာ့စ်နဲ့ကီရှာ၊
                ကလေးနှစ်ယောက်ရနေပြီ ဖြစ်တဲ့ ဝစ်နူနဲ့အီမဲလ်ဒါ၊ ရည်စားရထားတာ မကြာသေးတဲ့ တိုမို ဆိုပြီး
                စုစုပေါင်း (၇) ယောက် ပါဝင်ပါတယ်။ပေါင်းလာတာ ကြာပြီဖြစ်တဲ့ အကြောင်းသိတွေ ပျော်ပျော်ပါးပါး စားကြသောက်ကြရင်း
                အိမ်ကြီးရှင် အီဗာက ဂိမ်းတစ်ခု ကစားကြဖို့ ပြောလိုက်ရာကနေ ဇာတ်လမ်းက စ,ပါတယ်။
                သူပြောတဲ့ ဂိမ်းက ဖုန်းတွေအားလုံးကို စားပွဲပေါ်မှာ တင်ထားပြီး
                ဝင်လာသမျှ မက်ဆေ့ဂျ်တွေ၊ ဖုန်းကောလ်တွေ၊ အီးမေးလ်တွေကို အတူတူဝိုင်းဖတ်ကြဖို့ပါ။ဆော့ရင်လည်း မကောင်း၊ မဆော့ပြန်ရင်လဲ အထင်လွဲခံရမှာစိုးတာနဲ့ အဲဒီဂိမ်းကို ဆော့ကြရင်းကနေ
                တစ်ယောက်ချင်းစီရဲ့ လျှို့ဝှက်ချက်တွေ ပေါ်လာပြီး ပြဿနာတွေက သပွတ်အူလို ရှုပ်ထွေးကုန်ပါတော့တယ်။လူတွေရဲ့ လူသိမခံနိုင်တဲ့ လျှို့ဝှက်ချက်တွေ၊ ခံစားချက်တွေကို တစ်စချင်းစီ ထုတ်ပြသွားတာကြောင့်
                (၂ )နာရီကျော်ကျော်က ဘယ်လိုကုန်လို့ကုန်သွားမှန်း မသိလိုက်တဲ့ ဇာတ်ကားမျိုးပါ။အညွှန်းဖတ်နေရင်းနဲ့ ဒီဇာတ်ကားကို ကြည့်ဖူးသလိုပဲလို့ ခံစားမိလာရင်တော့….ဟုတ်ပါတယ်….
                2016 က ထွက်ခဲ့တဲ့ အီတလီ ဇာတ်ကားကို remake ပြန်ရိုက်ထားတာပါ။မူရင်း အီတလီကားက အကြီးအကျယ်အောင်မြင်ခဲ့ပြီး
                စပိန်၊ မက္ကဆီကို၊ တောင်ကိုရီးယား၊ ပြင်သစ်၊ တရုတ်၊ ရုရှား အပါအဝင်
                နိုင်ငံပေါင်း ၂၀ ကျော်က remake ပြန်ရိုက်ခဲ့ကြပါတယ်။အဲဒီ remake တွေထဲကမှ ဒီကားကတော့ 2022 ခုနှစ်မှာ အင်ဒိုနီးရှားက ပြန်ရိုက်ထားတဲ့ ဇာတ်ကားပါ။အင်ဒို remake ကားဆိုပေမဲ့ အတော်လေး ကြည့်လို့ကောင်းပြီး
                setting ပိုင်း၊ သရုပ်ဆောင်ပိုင်း၊ musical ပိုင်း ဘာတစ်ခုမှ အပြစ်ပြောစရာ မရှိတဲ့ ဇာတ်ကားပါ။အီတလီဒဏ္ဍာရီနဲ့ အင်ဒိုရိုးရာတွေကို ပါးပါးနပ်နပ် ချိတ်ဆက်ပြထားပြီး
                မူရင်း ဇာတ်ကားရဲ့ အရသာလည်း မပျက်သလို ဆန်းသစ်တဲ့ တင်ဆက်မှုကိုလည်း မြင်တွေ့ရမှာပါ။mystery ဆန်ဆန် အထုပ်ဖြေပြတာမျိုးကို ကြိုက်ရင်တော့ မြည်းစမ်းကြည့်သင့်ပါတယ်။
                IMDb rating ကလည်း 7.5 အထိ ရထားပါတယ်။အညွှန်း နဲ့ ဘာသာပြန်ကတော့ Roman NoX ပဲ ဖြစ်ပါတယ်။", 
                'cover_image' => "https://image.tmdb.org/t/p/w185/rMSeZk9kCZhxVl3OOXIH29Gx1W6.jpg", 
                'genres' => 'Action', 
                'author' => 'Aleksey Shaparev', 
                'tags' => "Action drama", 
                'imdb_ratings' => 9.0, 
                'pdf_download_link' => "https://channelmyanmar.org/perfect-strangers-2022/"
            ],
            [
                'title' => "Battlebox (2023)", 
                'summary' => "၁၉၄၁ ခုနှစ်၊ ဟောင်ကောင်ဟာ ဗြိတိသျှအင်ပိုင်ယာကြီးရဲ့ အရှေ့ဘက်စစ်မျက်နှာခံတပ်တစ်ခု ဖြစ်နေတဲ့ကာလ……
                ဂျပန်တပ်တွေရုတ်တရက်တိုက်ခိုက်လာခဲ့တဲ့အခါ….
                အလွဲလွဲအမှားမှား ဖြစ်ကုန်တဲ့ စစ်ဖက်ထောက်လှမ်းရေးပြဿနာကြားမှာ ပါဝင်ပတ်သက်နေမိတဲ့ တရုတ်ညီအစ်မနှစ်ယောက်ရဲ့ ဇာတ်လမ်း….
                Gin Drinker ခံစစ်ကြောင်းမှာ ဂျပန်တွေအဝိုင်းခံလိုက်ရတဲ့ ဗြိတိသျှ-အိန္ဒိယစစ်သားတွေရဲ့ ဖြစ်ပုံပျက်ပုံတွေ….
                သွေးပျက်ချင်စရာ စစ်ပွဲရဲ့မြူနှင်းတွေကြားမှာ မေဂျာဂျင်နရယ် မော့ဘီနဲ့ သူ့ရဲ့ အထက်တန်းအရာရှိတွေ အရှက်ကွဲခံပြီးလက်နက်ချကြမှာလား၊
                အသက်အသေခံပြီး အဆုံးထိခံတိုက်သွားကြမှာလား….
                (ဘယ်လမ်းကိုရွေးဖို့ သတ္တိပိုလိုမလဲ) စတာတွေကို ဇာတ်ကားလေးကြည့်ရင်း
                ဆက်လက်ရှုစားလိုက်ကြပါဦး………….", 
                'cover_image' => "https://image.tmdb.org/t/p/w185/fDeqyKwEtms2IFtT8SDvURZWqAF.jpg", 
                'genres' => 'Drama, History, War', 
                'author' => 'Aleksey Shaparev', 
                'tags' => "Drama, History, War", 
                'imdb_ratings' => 9.0, 
                'pdf_download_link' => "https://channelmyanmar.org/battlebox-2023/"
            ],
            [
                'title' => "Northeast Zoo ( 2023 )", 
                'summary' => "ဒီနေ့မှာတော့ CM က ပရိတ်သတ်ကြီးကို ဘဝအမောတွေပြေစေဖို့
                ပေါ့ပေါ့ပါးပါး ဟာသကားလေးတစ်ကားနဲ့မိတ်ဆက်ပေးပါရစေရှင် ။“ မြို့ကိုတက်ပြီးအလုပ်လုပ်နေပေမဲ့ အလုပ်မှာ အဆင်မပြေမှုတွေနဲ့ ရင်ဆိုင်နေရသူ ၊
                ဖခင်ဖြစ်သူဟာ လျောင်ခရိုင်မှာ တိရိစ္ဆာန်ရုံတစ်ခုကိုဖွင့်လှစ်ထားပေမဲ့
                ၎င်းတိရိစ္ဆာန်ရုံကို ဦးစီးဖို့ နည်းနည်းလေးမှ စိတ်ကူးမရှိသူ ၊
                ဖခင်နဲ့လဲ ဆက်ဆံရေး အဆင်မပြေသူ – စွင်းရှောင်ဟူ တစ်နေ့မှာတော့ ရင်းနီးမြှုပ်နှံသူတစ်ချို့ဟာ စွင်းရှောင်ဟူ ဖခင်ရဲ့
                တိရိစ္ဆာန်ရုံကို စီးပွားရေးနယ်ချဲ့ဖို့အတွက် မျက်စိကျနေခဲ့ကာ
                တိရိစ္ဆာန်ရုံမြေနေရာကို လက်ဝါးကြီးအုပ်ဖို့ ကြံစည်လာခဲ့ပါတယ် ။အဲဒါနဲ့ပဲ အလုပ်အကိုင် / ငွေကြေးအဆင်မပြေတဲ့ စွင်းရှောင် ဟူကို
                ငွေနဲ့ဖျားယောင်းကာ တိရိစ္ဆာန်ရုံရဲ့ စီးပွားရေးဖျက်ဆီးပစ်ပြီး
                မြေနေရာကို ဖယ်ခိုင်းခဲ့ပါတယ် ။ ဖခင်အပေါ်လဲ စိတ်ကျေနပ်မှုမရှိတဲ့
                စွင်းရှောင်ဟူဟာ ဒီသဘောတူညီချက်ကိုလက်ခံပြီး
                တိရိစ္ဆာန်ရုံကို ဖျက်ဆီးပစ်ဖို့ စီစဥ်လာခဲ့ပါတော့တယ် ။❏ စွင်းရှောင်ဟူတစ်ယောက် ဖခင်ဖြစ်သူကိုဘယ်လိုရင်ဆိုင်မှာလဲ ?
                ❏ တိရိစ္ဆာန်ရုံဖျက်ဆီးပြစ်ဖို့ အကြံကရော အောင်မြင်နိုင်ပါ့မလား ?
                ❏ သူ့အပေါ်ဆို ဘယ်အရာနေနေ သစ္စာရှိကြတဲ့
                သူငယ်ချင်းတွေကရော သူ့လုပ်ရပ်အတွက် ခွင့်လွှတ်နိုင်ပါ့မလား ?
                ❏ ဘယ်လိုအလွဲလွဲ အမှားမှားတွေ ဖြစ်လာဦးမလဲဆိုတာ
                ဟာသလေးတွေနှောပြီး ရိုက်ကူးထားတဲ့ ဒီဇာတ်ကားလေးကို အခုပဲ ကြည့်ရှုလိုက်ရအောင်ပါနော် ။", 
                'cover_image' => "https://image.tmdb.org/t/p/w185/kTM1KPeR8mRNFXiatjPLCIVcMp9.jpg", 
                'genres' => 'Comedy, Drama', 
                'author' => 'China', 
                'tags' => "Comedy, Drama", 
                'imdb_ratings' => 9.0, 
                'pdf_download_link' => "https://channelmyanmar.org/northeast-zoo-2023/"
            ],

        ];

        foreach ($data as $item) {
            Movie::create( $item);
        }



       
    }
}
